### 6. Pandas

In [100]:
import pandas as pd

In [237]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'

df_data = pd.read_csv(data_url, sep='\s+', header = None) # seperate 빈공간, column 없음

In [238]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [239]:
df_data.columns = [
    'CRIM','ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO' ,'B', 'LSTAT', 'MEDV']

In [240]:
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [243]:
type(df_data.values)

numpy.ndarray

#### Series

In [92]:
from pandas import Series

In [103]:
list_data = [1,2,3,4,5]
example = Series(data=list_data)
example

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [249]:
list_data = [1,2,3,4,5]
index_data = ['a','b','c','d','e']

example_1 = Series(data=list_data, index=index_data)
example_1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [250]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(dict_data, dtype=np.float32, name="example_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [251]:
example_obj['a']

1.0

In [252]:
example_obj['a'] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

#### Dataframe

In [98]:
from pandas import DataFrame

In [106]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [256]:
DataFrame(raw_data, columns=['last_name', 'age'])

  last_name  age
0    Miller   42
1  Jacobson   52
2       Ali   36
3    Milner   24
4     Cooze   73

In [258]:
DataFrame(raw_data, columns=['last_name', 'age','sex']) # new column insert

  last_name  age  sex
0    Miller   42  NaN
1  Jacobson   52  NaN
2       Ali   36  NaN
3    Milner   24  NaN
4     Cooze   73  NaN

In [259]:
# series 추출
df.last_name

0      Miller
1    Jacobson
2         Ali
3      Milner
4       Cooze
Name: last_name, dtype: object

In [260]:
df['last_name']

0      Miller
1    Jacobson
2         Ali
3      Milner
4       Cooze
Name: last_name, dtype: object

In [261]:
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [263]:
# loc : index location
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
Name: 1, dtype: object

In [265]:
# iloc : index position
df['age'].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [271]:
s = pd.Series(np.nan, index=[10,11,12,13,14,4,5,6,7,8,9])
s

10   NaN
11   NaN
12   NaN
13   NaN
14   NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [272]:
# loc : index의 이름
s.loc[:4]

10   NaN
11   NaN
12   NaN
13   NaN
14   NaN
4    NaN
dtype: float64

In [274]:
# iloc : index의 위치
s.iloc[:4]

10   NaN
11   NaN
12   NaN
13   NaN
dtype: float64

In [275]:
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [281]:
df = DataFrame(raw_data, columns=['first_name','last_name','age','city','debt'])
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [284]:
# transpose
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [285]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [286]:
df.to_csv()

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,San Francisco,True\n1,Molly,Jacobson,52,Baltimore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [288]:
del df['debt']

In [289]:
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

#### Selection & Drop

In [291]:
df[['first_name','last_name','age']].head(3)

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36

In [292]:
# index number는 row 기준으로 출력
df[:3]

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami

In [293]:
df['city'][:3]

0    San Francisco
1        Baltimore
2            Miami
Name: city, dtype: object

In [299]:
df_series = df['city']
df_series[[1,3]] # series는 index로 접근 가능

1    Baltimore
3      Douglas
Name: city, dtype: object

In [300]:
df.index = df['age']

In [301]:
df

    first_name last_name  age           city
age
42       Jason    Miller   42  San Francisco
52       Molly  Jacobson   52      Baltimore
36        Tina       Ali   36          Miami
24        Jake    Milner   24        Douglas
73         Amy     Cooze   73         Boston

In [303]:
# basic, loc, iloc
df[['first_name','city']][:3]

    first_name           city
age
42       Jason  San Francisco
52       Molly      Baltimore
36        Tina          Miami

In [311]:
df.loc[[42,52],['age','city']]

     age           city
age
42    42  San Francisco
52    52      Baltimore

In [108]:
df.iloc[:2,:3]

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52

In [316]:
# index 재설정
df.index = list(range(0,5))
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [317]:
# data drop
df.drop(1)

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [319]:
df.drop('city',axis=1)

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36
3       Jake    Milner   24
4        Amy     Cooze   73

#### Dataframe Operation

In [322]:
# Series Operation
s1 = Series(range(1,6), index=list('abcde'))
s2 = Series(range(6,11), index=list('bcdef'))

In [325]:
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [326]:
s2

b     6
c     7
d     8
e     9
f    10
dtype: int64

In [327]:
# index가 같은 것 끼리 연산
s1.add(s2)

a     NaN
b     8.0
c    10.0
d    12.0
e    14.0
f     NaN
dtype: float64

In [328]:
s1 + s2

a     NaN
b     8.0
c    10.0
d    12.0
e    14.0
f     NaN
dtype: float64

In [332]:
# dataframe operation
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list('abc'))
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list('abcd'))

In [333]:
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [334]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [338]:
# dataframe은 index, column 모두 고려
df1.add(df2)

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [339]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [340]:
# map for Series
s = Series(np.arange(5))

In [342]:
s.map(lambda x: x**2)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [346]:
m = {0:'a', 1:'b', 2:'c'}

s.map(m)

0      a
1      b
2      c
3    NaN
4    NaN
dtype: object

#### Groupby

In [353]:
# data from: 
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [359]:
# Hierarchical index - unstack : matrix 형태로
h_index = df.groupby(['Team','Year'])['Points'].sum()
h_index

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [360]:
h_index.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

In [363]:
# Hierarchical index - swaplevel : index의 level변경
h_index.swaplevel().unstack()

Team  Devils  Kings  Riders  Royals
Year
2014   863.0  741.0   876.0   701.0
2015   673.0  812.0   789.0   804.0
2016     NaN  756.0   694.0     NaN
2017     NaN  788.0   690.0     NaN

In [369]:
h_index.sum(level=0)

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

In [367]:
# grouped : split된 상태
grouped = df.groupby('Team')

for i in grouped:
    print(i)

('Devils',      Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673)
('Kings',     Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788)
('Riders',       Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690)
('Royals',       Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804)

In [368]:
grouped.get_group('Riders')

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690

In [379]:
grouped.agg(sum)

        Rank  Year  Points
Team
Devils     5  4029    1536
Kings      9  8062    3097
Riders     7  8062    3049
Royals     5  4029    1505

In [380]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [384]:
df.groupby(['Team','Year']).agg({'Rank':max,'Points':sum})

             Rank  Points
Team   Year
Devils 2014     2     863
       2015     3     673
Kings  2014     3     741
       2015     4     812
       2016     1     756
       2017     1     788
Riders 2014     1     876
       2015     2     789
       2016     2     694
       2017     2     690
Royals 2014     4     701
       2015     1     804

In [376]:
df.groupby('Team').filter(lambda x: x['Rank'].sum()>8)

    Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788

In [378]:
df.groupby('Team').filter(lambda x: len(x)>3) # len(x) : grouped된 dataframe의 갯수

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

#### Pivot table

In [385]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [389]:
df.pivot_table(['Points'], index='Team', aggfunc=sum)

        Points
Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505

#### Merge & Concat

#### DB Persistence

In [390]:
import sqlite3

In [391]:
# pickle persistence